// L1.16
// Быстрая сортировка (quicksort)
// Реализовать алгоритм быстрой сортировки массива
// встроенными средствами языка. Можно использовать рекурсию.

// Подсказка: напишите функцию quickSort([]int) []int которая сортирует срез целых чисел.
// Для выбора опорного элемента можно взять середину или первый элемент.

// Дедлайн — 6 нояб, 02:59

// Решение:

package main

import "fmt"

var mas = []int{1, 5, 3, 9, 0, -1, 0, 4, -7, 2, 5, 23, -99, 1000, -6, 3}

func quickSort([]int) []int {

	return []int{}
}

func main() {
	fmt.Printf("%+v", quickSort(mas))
}
